# Process, Thread

## Process

### Program
- 어떤 작업을 위해 실행할 수 있는 파일
ex: kakaotalk.exe 등

### Process
- 운영 체제 위에서 실행 중이거나 실행 대기 중인 프로그램을 말함

즉, 메모리에 올라와 실행되고 있는 프로그램의 인스턴스임
좀 더 자세히 말하자면 하드디스크에 있는 프로그램을 실행하면 실행을 위해 메모리 할당이 일어나고, 할당된 메모리 공간으로 프로그램이 올라감. 이 순간부터 프로세스라고 부름

프로세스는 운영체제로부터 각각의 독립된 메모리 영역(code, data, stack, heap)을 할당 받음

- 코드 영역 : 프로그래머가 작성한 프로그램이 저장되는 영역.
  (실행할 프로그램의 코드나 명령어들)
  CPU는 코드 영역에 저장된 명령어들을 하나씩 처리함.
- 데이터 영역 : 코드에서 선언한 변수나 파일들의 각종 데이터들이 저장되는 영역.
  프로그램이 실행되면서 할당되고 종료되면서 소멸함
- 스택 영역 : 함수 안에서 선언된 지역변수, 매개 변수, 리턴 값 등이 저장됨. 함수 호출 시 기록되고 종료되면 제거됨
- 힙 영역 : 동적으로 할당되는 데이터를 위해 존재함

프로세스는 최소 1개 이상의 스레드를 가지고 있으며, 각 프로세스는 별도의 주소 공간에서 실행되며 기본적으로 다른 프로세스의 자원에 접근할 수 없음.
어떤 한 프로세스가 다른 프로세스에 접근하려면 프로세스 간 통신(IPC(inter process communication))를 해야함
ex: 소켓이나 파일, 파이프 등을 이용한 통신 방법

프로세스 내에는 최소 한 개의 스레드를 가지고 스레드 단위로 스케줄링을 함

=> 우리가 음악을 들으면서 메일을 보내고 카톡 메시지가 오는 등의 여러 프로세스가 동시에 실행되는 것처럼 보이지만 CPU는 한 번에 하나의 명령밖에 처리할 수 없음. 즉 동시에 처리되는 것처럼 보여도 사실은 프로세스들을 빠르게 번갈아가면서 실행하고 관리하는 것임

### Thread

<img src="https://velog.velcdn.com/cloudflare/aeong98/411e94f9-758b-40e3-93cb-938cde5fbd15/image.png" width="50%" height="50%">

하나의 프로세스 내에서 동시에 진행되는 작업 갈래, 흐름의 단위를 말함

스레드는 프로세스 내에서 필요한 스택만 할당받고 코드, 힙, 데이터 영역은 각 스레드가 공유함(같은 프로세스 내에 있는 스레드끼리 자원(코드, 데이터, 힙)을 공유하며 실행됨)

### CPU

컴퓨터가 사용자의 명령에 대한 작업을 수행하는 처리장치

cpu는 한정된 자원을 가지고 있어 최대한의 성능을 이끌어내기 위해서는 cpu를 적절하고 효율적으로 사용해야함
즉, OS는 실행대기 중인 프로그램(프로세스)들에게 CPU 자원 배정을 적절히해 시스템의 성능을 끌어올릴 수 있음

### Process와 Thread의 차이점

<img src="https://velog.velcdn.com/cloudflare/aeong98/2ab2b490-e027-4b03-9a54-8104199b6c60/image.png" width="50%" height="50%">

운영체제는 프로세스마다 독립된 메모리 영역을 code,data,stack,heap의 형식으로 할당함.
각각 독립된 메모리 영역을 할당하기 때문에 프로세스는 다른 프로세스의 변수나 자료에 접근할 수 없음

<img src="https://velog.velcdn.com/cloudflare/aeong98/ce1b2913-bef7-46ff-9444-00dbd22489ef/image.png" width="50%" height="50%">

이와 달리 스레드는 메모리를 서로 공유할 수 있음. 즉, 프로세스가 할당받은 메모리 영역 내에서 stack 형식으로 할당된 메모리 영역은 따로 할당받고 나머지 영역(code, heap, data) 을 공유함. 따라서 각각의 스레드는 별도의 스택을 가지고 있지만 code, heap, data 부분은 서로 공유해 읽고 쓸 수 있게 됨

----
## 프론트엔드 관점에서의 프로세스와 스레드의 차이점 
프로세스와 스레드는 웹 브라우저의 작동 방식과 밀접한 관련이 있다.
프로세스와 스레드를 사용하여 웹 애플리케이션을 효율적으로 실행하고 관리한다.

## 용어 정리 
- 프로그램 : 파일이 저장 장치에 저장되어 있지만 메모리에는 올라가지 있지 않은 정적인 상태. (window-exe파일/MaxOS .dmg파일 )
- 프로세스 : 프로그램을 실행하는 순간 해당 파일은 컴포터 메모리에 올라가게 되고, 동적인 상태가 된다. 
- 스레드 : 프로세스의 한계를 해결하기 위해 만들어진 개념 - 프로세스 내에서 실행되는 결양의 실행단위로, 프로세스의 자원을 공유한다.

## 프로세스
- 브라우저 프로세스 : 웹 브라우저는 각 탭을 별도의 프로세스로 실행한다. 한 탭에서 발생하는 문자게 다른 탭이나 브라우저에 영향을 주지 않도록 격리하는데 도움이 된다.
- 안전성과 독립성: 탭이 별도의 프로세스로 동작하므로 한 탭에서 발생한 오류나 메모리 누수가 다른 탭에 영향을 미치지 않아 안정성이 향상된다.

## 스레드
- 렌더링 엔진의 스레드 : 프론트엔드 개발에 중요한 요소는 브라우저의 렌더링 엔진이다.
렌더링 엔진은 HTML. CSS 를 파싱하고 DOM 트리를 구축하는 등의 작업을 수행하는 여러 스레드로 구성되어 있다.
- 자바스크립트 실행 : 자바스크립트는 싱글 스레드로 실행된다. 하지만 비동기 처리와 이벤트 루프를 통해 동시에 여러 작업을 처리하는 것처럼 보일 수 있다.

## 프론트엔드 개발 적용
- 비동기 프로그래밍의 중요성 : 비동기 프로그래밍은 UI 스레드를 차단하지 않고 백그라운드에서 데이터를 가져오거나 처리하는데 중요하다.
- 웹 워커의 사용 : 복잡한 계산이나 데이터 처리를 백그라운드 스레드에서 수행하기 위해 웹워커를 사용 할 수 있다. 메인 스레드의 UI 블로킹을 방지하고 성능을 향상 시킨다.
웹 애플리케이션의 성능 최적화 와 효율적인 리소스 관리에 필수적이다.  이러한 이해를 바탕으로 사용자에게  더 나은 경험을 제공하는 웹 에플리케이션을 구축할 수 있다.
